Revit 2024 API
UnitTypeId.KilonewtonMeters Property
 Kilonewton meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId KilonewtonMeters { get; }
Visual Basic
Public Shared ReadOnly Property KilonewtonMeters As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ KilonewtonMeters {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace